Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
s_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CHR_HEADER"               = null
              - "DPORTAL_BUCKET"           = "gaspi-dataportal20250331043651003800000004"
              - "DYNAMO_CLINIC_JOBS_TABLE" = "sbeacon-dataportal-clinic-jobs"
              - "END_HEADER"               = null
              - "HTS_S3_HOST"              = "s3.ap-southeast-3.amazonaws.com"
              - "LOOKUP_REFERENCE"         = null
              - "PGXFLOW_BUCKET"           = "pgxflow-backend-20250516044447371700000001"
              - "PGXFLOW_GNOMAD_LAMBDA"    = "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-gnomad"
              - "REFERENCE_BUCKET"         = "pgxflow-backend-references-20250516044449116600000003"
              - "RESULT_SUFFIX"            = "_lookup_results.jsonl"
              - "SEND_JOB_EMAIL_ARN"       = "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-lookup-sendJobEmail"
              - "START_HEADER"             = null
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/lookup",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/acc1215b63c0d54eae6f4327802563206a260561f845fdd7c54991e914f94d0b.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/acc1215b63c0d54eae6f4327802563206a260561f845fdd7c54991e914f94d0b.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3097467821946640047" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/d86b632af5f25dbb7d2c3789899df165183af56648b7486c70ccc9daffc37e6a.zip" -> "builds/acc1215b63c0d54eae6f4327802563206a260561f845fdd7c54991e914f94d0b.zip"
          ~ "timestamp" = "1751931219000000000" -> "1753773259846054000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:557690600725:log-group:/aws/lambda/pgxflow-backend-lookup-sendJobEmail" -> null
      - id                = "/aws/lambda/pgxflow-backend-lookup-sendJobEmail" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/pgxflow-backend-lookup-sendJobEmail" -> null
      - region            = "ap-southeast-3" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all          = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::557690600725:role/pgxflow-backend-lookup-sendJobEmail" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-06-09T01:11:34Z" -> null
      - force_detach_policies = true -> null
      - id                    = "pgxflow-backend-lookup-sendJobEmail" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "pgxflow-backend-lookup-sendJobEmail" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all              = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - unique_id             = "AROAYDWHTHUKTFNKJ36R3" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "pgxflow-backend-lookup-sendJobEmail-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "lambda:InvokeFunction"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:lambda:ap-southeast-3:557690600725:function:cognito-sendClinicJobEmail"
                        },
                      - {
                          - Action   = [
                              - "dynamodb:UpdateItem",
                              - "dynamodb:PutItem",
                              - "dynamodb:GetItem",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-clinic-jobs"
                        },
                      - {
                          - Action   = "cognito-idp:ListUsers"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:cognito-idp:ap-southeast-3:557690600725:userpool/ap-southeast-3_PXRtWWUqW"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "pgxflow-backend-lookup-sendJobEmail-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-southeast-3:557690600725:log-group:/aws/lambda/pgxflow-backend-lookup-sendJobEmail:*:*",
                              - "arn:aws:logs:ap-southeast-3:557690600725:log-group:/aws/lambda/pgxflow-backend-lookup-sendJobEmail:*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because aws_iam_role_policy.additional_jsons is not in configuration)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "pgxflow-backend-lookup-sendJobEmail:pgxflow-backend-lookup-sendJobEmail-0" -> null
      - name        = "pgxflow-backend-lookup-sendJobEmail-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:557690600725:function:cognito-sendClinicJobEmail"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:557690600725:userpool/ap-southeast-3_PXRtWWUqW"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-lookup-sendJobEmail" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_iam_role_policy.logs[0] will be destroyed
  # (because aws_iam_role_policy.logs is not in configuration)
  - resource "aws_iam_role_policy" "logs" {
      - id          = "pgxflow-backend-lookup-sendJobEmail:pgxflow-backend-lookup-sendJobEmail-logs" -> null
      - name        = "pgxflow-backend-lookup-sendJobEmail-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-3:557690600725:log-group:/aws/lambda/pgxflow-backend-lookup-sendJobEmail:*:*",
                          - "arn:aws:logs:ap-southeast-3:557690600725:log-group:/aws/lambda/pgxflow-backend-lookup-sendJobEmail:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-lookup-sendJobEmail" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-lookup-sendJobEmail" -> null
      - code_sha256                    = "JOE4U2KyHrzcGQ23hfTaJIxx5FiIE4QpTAPBBfleLFE=" -> null
      - description                    = "Invokes sendJobEmail to send email to user" -> null
      - filename                       = "builds/725b2562166dbf31a256a1aa152f5e4119a08f195a8effd01dd97246da888268.zip" -> null
      - function_name                  = "pgxflow-backend-lookup-sendJobEmail" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "pgxflow-backend-lookup-sendJobEmail" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-lookup-sendJobEmail/invocations" -> null
      - last_modified                  = "2025-07-11T00:47:46.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:48",
        ] -> null
      - memory_size                    = 1792 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-lookup-sendJobEmail:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-lookup-sendJobEmail:$LATEST/invocations" -> null
      - region                         = "ap-southeast-3" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::557690600725:role/pgxflow-backend-lookup-sendJobEmail" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "JOE4U2KyHrzcGQ23hfTaJIxx5FiIE4QpTAPBBfleLFE=" -> null
      - source_code_size               = 1070 -> null
      - tags                           = {
          - "Environment"           = "dev"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - tags_all                       = {
          - "Environment"           = "dev"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - timeout                        = 28 -> null
      - version                        = "$LATEST" -> null
        # (4 unchanged attributes hidden)

      - environment {
          - variables = {
              - "COGNITO_CLINIC_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:557690600725:function:cognito-sendClinicJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"        = "sbeacon-dataportal-clinic-jobs"
              - "USER_POOL_ID"                    = "ap-southeast-3_PXRtWWUqW"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/pgxflow-backend-lookup-sendJobEmail" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "64130497791449187" -> null
      - triggers = {
          - "filename"  = "builds/725b2562166dbf31a256a1aa152f5e4119a08f195a8effd01dd97246da888268.zip"
          - "timestamp" = "1751931219000000000"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/23c1c917d91841728fbe19181191ba4ce10dac51e9255b6cadb09864299463dc.zip" -> "builds/e802c12402d8e5de28a5bed83831dafe4a6ff02a61127ec28e39e8850f292ee1.zip"
        id                             = "pgxflow-backend-lookup-updateReferenceFiles"
      ~ last_modified                  = "2025-07-11T00:47:50.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:48",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/updateReferenceFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/e802c12402d8e5de28a5bed83831dafe4a6ff02a61127ec28e39e8850f292ee1.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e802c12402d8e5de28a5bed83831dafe4a6ff02a61127ec28e39e8850f292ee1.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2008159984577530638" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/23c1c917d91841728fbe19181191ba4ce10dac51e9255b6cadb09864299463dc.zip" -> "builds/e802c12402d8e5de28a5bed83831dafe4a6ff02a61127ec28e39e8850f292ee1.zip"
          ~ "timestamp" = "1749694109000000000" -> "1753773259967070200"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "d248cfafd31c7a7eca30da44a672ae3286ef3413"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/pharmcat"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:0af404f9fa2d6a2e1caff11484ed4d1cefff37f7bbd6f893e78b0e2a20c7bc61" -> (known after apply)
        name                 = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      ~ sha256_digest        = "sha256:0af404f9fa2d6a2e1caff11484ed4d1cefff37f7bbd6f893e78b0e2a20c7bc61" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "14abf7c4d16747381de70ded360eddccc6a881ca" -> "d248cfafd31c7a7eca30da44a672ae3286ef3413"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "a06e402746d6cbe8e7d4adeeaa4053b3ff8c837d"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/preprocessor"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:945fe3c57d3f790beda9006d57888c204ae1ff80bcf715c4c869af00c91fd8f0" -> (known after apply)
        name                 = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      ~ sha256_digest        = "sha256:945fe3c57d3f790beda9006d57888c204ae1ff80bcf715c4c869af00c91fd8f0" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "34be40bd09a7a7360b7e81c78d6592c03293f6bf" -> "a06e402746d6cbe8e7d4adeeaa4053b3ff8c837d"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:557690600725:log-group:/aws/lambda/pgxflow-backend-pharmcat-getResultsURL" -> null
      - id                = "/aws/lambda/pgxflow-backend-pharmcat-getResultsURL" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/pgxflow-backend-pharmcat-getResultsURL" -> null
      - region            = "ap-southeast-3" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all          = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::557690600725:role/pgxflow-backend-pharmcat-getResultsURL" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-05-16T04:44:50Z" -> null
      - force_detach_policies = true -> null
      - id                    = "pgxflow-backend-pharmcat-getResultsURL" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "pgxflow-backend-pharmcat-getResultsURL" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all              = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - unique_id             = "AROAYDWHTHUKZWSAK4TEV" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "pgxflow-backend-pharmcat-getResultsURL-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "s3:GetObject"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::gaspi-dataportal20250331043651003800000004/projects/*/clinical-workflows/*"
                        },
                      - {
                          - Action   = "s3:ListBucket"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::gaspi-dataportal20250331043651003800000004"
                        },
                      - {
                          - Action   = "dynamodb:GetItem"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-project-users"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "pgxflow-backend-pharmcat-getResultsURL-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-southeast-3:557690600725:log-group:/aws/lambda/pgxflow-backend-pharmcat-getResultsURL:*:*",
                              - "arn:aws:logs:ap-southeast-3:557690600725:log-group:/aws/lambda/pgxflow-backend-pharmcat-getResultsURL:*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because aws_iam_role_policy.additional_jsons is not in configuration)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "pgxflow-backend-pharmcat-getResultsURL:pgxflow-backend-pharmcat-getResultsURL-0" -> null
      - name        = "pgxflow-backend-pharmcat-getResultsURL-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250331043651003800000004/projects/*/clinical-workflows/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250331043651003800000004"
                    },
                  - {
                      - Action   = "dynamodb:GetItem"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-project-users"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-pharmcat-getResultsURL" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_iam_role_policy.logs[0] will be destroyed
  # (because aws_iam_role_policy.logs is not in configuration)
  - resource "aws_iam_role_policy" "logs" {
      - id          = "pgxflow-backend-pharmcat-getResultsURL:pgxflow-backend-pharmcat-getResultsURL-logs" -> null
      - name        = "pgxflow-backend-pharmcat-getResultsURL-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-3:557690600725:log-group:/aws/lambda/pgxflow-backend-pharmcat-getResultsURL:*:*",
                          - "arn:aws:logs:ap-southeast-3:557690600725:log-group:/aws/lambda/pgxflow-backend-pharmcat-getResultsURL:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-pharmcat-getResultsURL" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-pharmcat-getResultsURL" -> null
      - code_sha256                    = "N9BFcA+N9tb7XBnKgGrni9WmoBCpKMEsAQPRSHi5VeI=" -> null
      - description                    = "Returns the presigned results URL for PGxFlow pharmcat results" -> null
      - filename                       = "builds/d2df92fff5a868bbdcaf874e61c535d70bbb9fa96753eef0590fbd1a82bdae0a.zip" -> null
      - function_name                  = "pgxflow-backend-pharmcat-getResultsURL" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "pgxflow-backend-pharmcat-getResultsURL" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-pharmcat-getResultsURL/invocations" -> null
      - last_modified                  = "2025-07-11T00:47:46.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:48",
        ] -> null
      - memory_size                    = 1792 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-pharmcat-getResultsURL:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-pharmcat-getResultsURL:$LATEST/invocations" -> null
      - region                         = "ap-southeast-3" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::557690600725:role/pgxflow-backend-pharmcat-getResultsURL" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "N9BFcA+N9tb7XBnKgGrni9WmoBCpKMEsAQPRSHi5VeI=" -> null
      - source_code_size               = 762 -> null
      - tags                           = {
          - "Environment"           = "dev"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - tags_all                       = {
          - "Environment"           = "dev"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - timeout                        = 28 -> null
      - version                        = "$LATEST" -> null
        # (4 unchanged attributes hidden)

      - environment {
          - variables = {
              - "DPORTAL_BUCKET"             = "gaspi-dataportal20250331043651003800000004"
              - "DYNAMO_PROJECT_USERS_TABLE" = "sbeacon-dataportal-project-users"
              - "RESULT_SUFFIX"              = "_pharmcat_results.json"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/pgxflow-backend-pharmcat-getResultsURL" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "2139472295887339967" -> null
      - triggers = {
          - "filename"  = "builds/d2df92fff5a868bbdcaf874e61c535d70bbb9fa96753eef0590fbd1a82bdae0a.zip"
          - "timestamp" = "1749694109000000000"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-pharmcat-gnomad:pgxflow-backend-pharmcat-gnomad-0"
        name        = "pgxflow-backend-pharmcat-gnomad-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250516044447371700000001/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250331043651003800000004/projects/*/clinical-workflows/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-pharmcat-sendJobEmail"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-gnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:48",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_binaries_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DPORTAL_BUCKET"           = "gaspi-dataportal20250331043651003800000004"
              - "DYNAMO_CLINIC_JOBS_TABLE" = "sbeacon-dataportal-clinic-jobs"
              - "PGXFLOW_BUCKET"           = "pgxflow-backend-20250516044447371700000001"
              - "RESULT_SUFFIX"            = "_pharmcat_results.json"
              - "SEND_JOB_EMAIL_ARN"       = "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-pharmcat-sendJobEmail"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4239133974946495406" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1749694109000000000" -> "1753773260171845000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:557690600725:log-group:/aws/lambda/pgxflow-backend-initPharmcat" -> null
      - id                = "/aws/lambda/pgxflow-backend-initPharmcat" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/pgxflow-backend-initPharmcat" -> null
      - region            = "ap-southeast-3" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all          = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::557690600725:role/pgxflow-backend-initPharmcat" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-05-16T04:44:48Z" -> null
      - force_detach_policies = true -> null
      - id                    = "pgxflow-backend-initPharmcat" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "pgxflow-backend-initPharmcat" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all              = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - unique_id             = "AROAYDWHTHUK3PNMTEQQC" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "pgxflow-backend-initPharmcat-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = "s3:ListBucket"
                          - Condition = {
                              - StringLike = {
                                  - "s3:prefix" = "projects/*/project-files/*"
                                }
                            }
                          - Effect    = "Allow"
                          - Resource  = "arn:aws:s3:::gaspi-dataportal20250331043651003800000004"
                        },
                      - {
                          - Action   = "s3:GetObject"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::gaspi-dataportal20250331043651003800000004/projects/*/project-files/*"
                        },
                      - {
                          - Action   = "dynamodb:GetItem"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-project-users"
                        },
                      - {
                          - Action   = [
                              - "dynamodb:UpdateItem",
                              - "dynamodb:PutItem",
                              - "dynamodb:GetItem",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-clinic-jobs"
                        },
                      - {
                          - Action   = "lambda:InvokeFunction"
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-preprocessor",
                              - "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-pharmcat-sendJobEmail",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "pgxflow-backend-initPharmcat-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-southeast-3:557690600725:log-group:/aws/lambda/pgxflow-backend-initPharmcat:*:*",
                              - "arn:aws:logs:ap-southeast-3:557690600725:log-group:/aws/lambda/pgxflow-backend-initPharmcat:*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because aws_iam_role_policy.additional_jsons is not in configuration)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "pgxflow-backend-initPharmcat:pgxflow-backend-initPharmcat-0" -> null
      - name        = "pgxflow-backend-initPharmcat-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = "projects/*/project-files/*"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal20250331043651003800000004"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250331043651003800000004/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "dynamodb:GetItem"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-project-users",
                          - "arn:aws:dynamodb:ap-southeast-3:557690600725:table/pgxflow-references",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-preprocessor",
                          - "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-pharmcat-sendJobEmail",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-initPharmcat" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_iam_role_policy.logs[0] will be destroyed
  # (because aws_iam_role_policy.logs is not in configuration)
  - resource "aws_iam_role_policy" "logs" {
      - id          = "pgxflow-backend-initPharmcat:pgxflow-backend-initPharmcat-logs" -> null
      - name        = "pgxflow-backend-initPharmcat-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-3:557690600725:log-group:/aws/lambda/pgxflow-backend-initPharmcat:*:*",
                          - "arn:aws:logs:ap-southeast-3:557690600725:log-group:/aws/lambda/pgxflow-backend-initPharmcat:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-initPharmcat" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-initPharmcat" -> null
      - code_sha256                    = "zFg+6C+TRTS6eUROhFii9lfdS5PUll7hrddurFkIq0A=" -> null
      - description                    = "Initializes a PGxFlow PharmCat run" -> null
      - filename                       = "builds/f624e087a9adeb61f30f12719dda195ef2bafbcd7ffa959ce2d4ae3450aa660d.zip" -> null
      - function_name                  = "pgxflow-backend-initPharmcat" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "pgxflow-backend-initPharmcat" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-initPharmcat/invocations" -> null
      - last_modified                  = "2025-07-11T00:49:28.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:48",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_binaries_layer:13",
        ] -> null
      - memory_size                    = 1792 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-initPharmcat:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-initPharmcat:$LATEST/invocations" -> null
      - region                         = "ap-southeast-3" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::557690600725:role/pgxflow-backend-initPharmcat" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "WicuPfw43Nkp0JNX/YCZ9OXOlgL/TK/4wRJxK6F4Akg=" -> null
      - source_code_size               = 1502 -> null
      - tags                           = {
          - "Environment"           = "dev"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - tags_all                       = {
          - "Environment"           = "dev"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - timeout                        = 28 -> null
      - version                        = "$LATEST" -> null
        # (4 unchanged attributes hidden)

      - environment {
          - variables = {
              - "DRUGS"                                = "clopidogrel"
              - "DYNAMO_CLINIC_JOBS_TABLE"             = "sbeacon-dataportal-clinic-jobs"
              - "DYNAMO_PGXFLOW_REFERENCES_TABLE"      = "pgxflow-references"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "GENES"                                = "CYP2C19"
              - "HTS_S3_HOST"                          = "s3.ap-southeast-3.amazonaws.com"
              - "ORGANISATIONS"                        = jsonencode(
                    [
                      - {
                          - drug = "CPIC Guideline Annotation"
                          - gene = "CPIC"
                        },
                      - {
                          - drug = "DPWG Guideline Annotation"
                          - gene = "DPWG"
                        },
                      - {
                          - drug = "FDA Label Annotation"
                          - gene = "CPIC"
                        },
                      - {
                          - drug = "FDA PGx Association"
                          - gene = "CPIC"
                        },
                    ]
                )
              - "PGXFLOW_PHARMCAT_PREPROCESSOR_LAMBDA" = "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-preprocessor"
              - "SEND_JOB_EMAIL_ARN"                   = "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-pharmcat-sendJobEmail"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/pgxflow-backend-initPharmcat" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-initPharmcat.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "8141210881506407867" -> null
      - triggers = {
          - "filename"  = "builds/f624e087a9adeb61f30f12719dda195ef2bafbcd7ffa959ce2d4ae3450aa660d.zip"
          - "timestamp" = "1752194686503965000"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-pharmcat:pgxflow-backend-pharmcat-0"
        name        = "pgxflow-backend-pharmcat-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250516044447371700000001"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250516044447371700000001/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-postprocessor",
                          - "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-pharmcat-sendJobEmail",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat"
      ~ image_uri                      = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers@sha256:0af404f9fa2d6a2e1caff11484ed4d1cefff37f7bbd6f893e78b0e2a20c7bc61" -> (known after apply)
      ~ last_modified                  = "2025-07-11T00:48:18.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DYNAMO_CLINIC_JOBS_TABLE"              = "sbeacon-dataportal-clinic-jobs"
              - "PGXFLOW_BUCKET"                        = "pgxflow-backend-20250516044447371700000001"
              - "PGXFLOW_PHARMCAT_POSTPROCESSOR_LAMBDA" = "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-postprocessor"
              - "SEND_JOB_EMAIL_ARN"                    = "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-pharmcat-sendJobEmail"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-postprocessor:pgxflow-backend-postprocessor-0"
        name        = "pgxflow-backend-postprocessor-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::pgxflow-backend-20250516044447371700000001",
                          - "arn:aws:s3:::gaspi-dataportal20250331043651003800000004",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250516044447371700000001/*"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250331043651003800000004/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-pharmcat-sendJobEmail",
                          - "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-pharmcat-gnomad",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-clinic-jobs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/1f677891b48ace69e4786e26b02d9661cd5cc377d9d42d6b8c371b54c2cbd061.zip" -> "builds/75a34daa0e26de4b6399744b6892c81bef10ac74d5555270aeaf1afaaa68f86f.zip"
        id                             = "pgxflow-backend-postprocessor"
      ~ last_modified                  = "2025-07-11T00:47:59.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:48",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_binaries_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DPORTAL_BUCKET"                 = "gaspi-dataportal20250331043651003800000004"
              - "DRUGS"                          = "clopidogrel"
              - "DYNAMO_CLINIC_JOBS_TABLE"       = "sbeacon-dataportal-clinic-jobs"
              - "GENES"                          = "CYP2C19"
              - "HTS_S3_HOST"                    = "s3.ap-southeast-3.amazonaws.com"
              - "ORGANISATIONS"                  = jsonencode(
                    [
                      - {
                          - drug = "CPIC Guideline Annotation"
                          - gene = "CPIC"
                        },
                      - {
                          - drug = "DPWG Guideline Annotation"
                          - gene = "DPWG"
                        },
                      - {
                          - drug = "FDA Label Annotation"
                          - gene = "CPIC"
                        },
                      - {
                          - drug = "FDA PGx Association"
                          - gene = "CPIC"
                        },
                    ]
                )
              - "PGXFLOW_BUCKET"                 = "pgxflow-backend-20250516044447371700000001"
              - "PGXFLOW_PHARMCAT_GNOMAD_LAMBDA" = "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-pharmcat-gnomad"
              - "RESULT_SUFFIX"                  = "_pharmcat_results.json"
              - "SEND_JOB_EMAIL_ARN"             = "arn:aws:lambda:ap-southeast-3:557690600725:function:pgxflow-backend-pharmcat-sendJobEmail"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_pharmcat/lambda/postprocessor",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/75a34daa0e26de4b6399744b6892c81bef10ac74d5555270aeaf1afaaa68f86f.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/75a34daa0e26de4b6399744b6892c81bef10ac74d5555270aeaf1afaaa68f86f.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1456826957109634459" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/1f677891b48ace69e4786e26b02d9661cd5cc377d9d42d6b8c371b54c2cbd061.zip" -> "builds/75a34daa0e26de4b6399744b6892c81bef10ac74d5555270aeaf1afaaa68f86f.zip"
          ~ "timestamp" = "1751931222000000000" -> "1753773260087334000"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-preprocessor:pgxflow-backend-preprocessor-0"
        name        = "pgxflow-backend-preprocessor-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = "projects/*/project-files/*"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = [
                          - "arn:aws:s3:::pgxflow-backend-references-20250516044449116600000003",
                          - "arn:aws:s3:::gaspi-dataportal20250331043651003800000004",
                        ]
                    },
                  - {
                      - Action   = "s3:G
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.